Repository: Thepilli/portfolio
Catalog: lib/src/localization/app_*.arb
Languages: cs

# homeSectionTitle
source: Home
cs: Úvod

# aboutSectionTitle
source: About
cs: O mě

# aboutSectionTitleAlt
source: About Me
cs: O mě

# experienceSectionTitle
source: Experience
cs: Zkušenosti

# projectsSectionTitle
source: Projects
cs: Projekty

# englishLanguage
source: English
cs: V Angličtině

# czechLanguage
source: Czech
cs: V Češtině

source: Resume
cs: Životopis

source: Download resume
cs: Stáhnout CV

# resumePresent
source: Present
cs: Současnost

# subDescription
source: Application Development Enthusiast
cs: Nadšenec do vývoje aplikací

# about
source: I am a young professional working in data analytics and big data area, focusing on AI and cognitive services, their implementation and configuration. My latest passion is building applications, bridging the gap between engineering and design I strive in international environment and welcome difficult tasks with open arms. I hold multiple professional certifications, with focus on data analytics, visualization and its monetization, as well as application development across multiple platforms.
cs: Jsem mladý ale zkušený profesionál se širokým zájmem o technologie, a momentálně působím v oblasti datové analýzy a big data. Zaměřuji se především na umělou inteligenci a kognitivní služby, a to jak na jejich implementaci, tak také konfiguraci. Mým nejnovějším zájmem je tvorba aplikací, která spojuje prvky inženýrství a designu, a tak vytváří most mezi technickými a estetickými aspekty. S vášní se věnuji tomuto procesu, abych zajistil nejen vynikající funkčnost, ale také zážitek pro uživatele. Prosperuji v mezinárodním prostředí, jsem zvyklý pracovat s týmy různých kultur či velikostí a vítám náročné úkoly s otevřenou náručí. Rozšiřuji si své znalosti prostřednictvím získávání různých certifikací. Mým hlavním zaměřením je analýza dat a vizualizace, jakož i vývoj aplikací pro různé platformy.

# appDevJobTitle
source: Application Development
cs: Developer aplikací

# appDevJobDescription
source: Working collaboratively using GitHub and GitLab for repository management tasks such as pull requests and peer reviews. Developed a multiplatform application to help patients with eating disorders as a pro bono project for the psychiatric clinic of the General University Hospital in Prague. Collaborating remotely with designers and engineers on pro bono projects, creating new brands, design systems, and websites for community organizations. My skills include studying stakeholders' requirements, conducting functional analysis, and developing offline-first mobile application components with Flutter and a REST API
cs: Spolupracuji s ostatními členy komunity pomocí GitHub a GitLab na úkolech jako jsou pull requesty nebo peer review jednotlivých úložišť. Vyvinul jsem aplikaci pro podporu pacientů trpících poruchami příjmu potravy, jako pro bono projekt ve spolupráci s Psychiatrickou klinikou Všeobecné Fakultní Nemocnice v Praze. Společně s ostatními designery a developery z pro bono komunity pracuji na tvorbě a designu webových aplikací. Tato spolupráce na dálku mi umožňuje úspěšně překonávat komunikační bariéry a dosahovat kvalitních výsledků. Nadále pracují na definici požadavků pro funkční analýzy IoT řešení a vyvíjím komponenty pro mobilní a webové aplikace pomocí frameworku Flutter a REST API.

# senDataScJobDescription
source: Led the successful migration of an existing solution to a newly designed custom platform, ensuring seamless integration of multiple data sources and implementing automated processing for enhanced efficiency. Drove the creation of accessible and inclusive products, focusing on designing digital experiences that catered to diverse user needs and promoting inclusivity through intuitive design and user-friendly interfaces. Developed an IoT solution focused on sustainability, leveraging IoT technologies to optimize resource usage, monitor environmental impact, and drive sustainable practices. Served as the main IoT tech analyst, overseeing the implementation and maintenance of IoT systems. Conducted a comprehensive review of campaign measurement strategies, resulting in the introduction of a consolidated data layer for improved data management and streamlined reporting processes. Implemented automation for data sourcing and reporting, enabling efficient evaluation of social media performance. Designed and created a series of internal performance dashboards tailored to the specific needs of various departments. These dashboards provided key insights and visual representations of performance metrics, empowering departments to make data-driven decisions and optimize their operations effectively.
cs: Vedl jsem úspěšnou migraci legacy řešení projektového managementu na nově vytvořenou platformu, včetně integrace nových datových zdrojů a jejich automatické procesování vedoucí ke zvýšení reportovacich možností. Vyvinul jsem řešení pro implementaci IoT projektu zaměřeného na udržitelnost, za využití sensorů na sledování energetické zátěže budov, jejího dopadu a možnostech snížení. Byl jsem hlavním technickým kontaktem pro IoT řešení, jejich architekturu a realizaci. Prováděl jsem dlouhosáhlou analýzu kampaňového managementu a strategie jeho měření, vedoucí k implementaci jednotného reportingového řešení pro usnadění a zlepšení datového managementu a repotovacih procesů. Součástí řešení byla kompletní automatizace pohybu dat, včetně jejich obohacení o kampaně ze sociálních médií a spojených vizualizací. Navrhl jsem a vyvinul několik dashboadů pro interní účely napříč odděleními. Tato nově identifikovaná data vedla ke zlepšení efektivity a usnadnění rozhodování v rámci jednotlivých oddělení

# busIntConJobDescription
source: Personalization Enablement - Project Delivery Manager: Accountable for overall delivery, collaborated with stakeholders, and used web analytics platforms (Google Analytics, Adobe Analytics, Salesforce). Proficient in JIRA, Confluence, REST API, Azure DevOps. Built project health dashboards for delivery and engineering metrics. Data Science Platform Support - DevOps Construction Manager: Led agile team in data science workflow preparation and technical process development. Supported Shiny application development and created technical documentation. Managed system development life cycle and connected DevOps tools.
cs: Působil jsem v několika seniorních rolích napříč projekty. Jako manager projektu zaměřeného na personalizaci zákazníků a jejich interakcí jsem spolupracoval ostatními stakeholdery na definici a realizaci jednotlivých požadavků, a to za použití platforem jako je Google Analytics, Adobe Analytics, nebo Salesforce. Pracoval jsem s nástroji jako je JIRA, Confluence, REST APIs, Azure DevOps. Vytvářel jsem dashboardy pro sledování a hodnocení stavu jednotlivých projektů a jejich metrik. Jako DevOps manager pro správu Data Science platformy jsem vedl agilní tým zajišťující podporu datových vědců a procesů spojených s jejich výzkumem, a následnou správu dle farmaceutických regulí. Vyvíjel jsem Shiny aplikace a sloužil jako technický konktakt pro jejich implemetnaci a tvorbu technické dokumentace. Zajišťoval jsem průběh životního cyklu vývoje platformy a spojených DevOps nástrojů.

# busIntAnaJobDescription
source: Quality Control & Digital Services Assessment - Big Data Architect: Reviewed Big Data solution design and system integration, optimizing performance and integration within AWS data lake. Conducted functional analysis for a Dealer Management System solution, defining products for OEM pricing models. Text Analytics - Business Integration Analyst: Analyzed business requirements, defined As Is & To Be states. Evaluated Speech to Text components and applied text analytics, Natural Language Processing, and Machine Learning for aggregated reports. Chatbot & Virtual Assistant Development - Developer & NLP Designer: Defined requirements, designed architecture, and managed Natural Language Understanding models. Developed chatbot solution for 20+ use cases using Agile methodology. Created KPI documentation, designed dialog flows, and led UATs.
cs: Prováděl jsem hodnocení big data architektur, jejich integraci a následně navrhoval možnosti pro zlepšení jejich zapojení do AWS datových skladů či lake. Prováděl jsem funkční analýzy systému pro správu dealerů a vytvářel podklady pro cenové modelování. Jako integrační analysta jsem vedl tvorbu produktů dle funkčních a technických požadavků, a popisoval stave současného a budoucího řešení. Za využití přepisu mluveného slova jsem prováděl analýzu textu, a aplikoval Natural Language Processing a strojové učení ke tvorbě reportů. Tvořil jsem architekturu pro aplikaci a správu Natural Language Understanding modelů. Vyvinul jsem chatbot řešení pro více jak 20 use času. S vyžitím agilní metodologie jsem vedl uživatelské a akceptační testování, vytvářel dokumentaci, a navrhoval průběh dialogů.

# portfolioDescription
source: Yes, it's THIS portfolio! This project follows a Riverpod-based Architecture, using a feature-first approach for its structure. It is fully responsive, and supports multiple themes and languages
cs: Ano, právě TOTO portfolio. Tento projekt je demonstrací Riverpod architektury pro state management, a feature projektové struktury. Jeho UI je plně adaptivní jak pro mobilní a desktopová zařízení, tak také pro tablety. Dále také nabízí volbu mezi barevnými tématy a jazyky. Tento projekt je vyvinut s využitím Flutter frameworku, a jeho zdrojový kód je k dispozici na GitHubu.

# projectOneDescription
source: Jidlo je lek is a mobile application developed as a pro bono project with the aim of providing assistance and support to individuals struggling with eating disorders. It serves as a valuable tool for patients, caregivers, or anyone interested in the EDs topic. It was developed in collaboration with the psychiatric clinic of the General University Hospital in Prague.
cs: Jídlo je lék je mobilní aplikace vyvinutá jako projekt pro bono s cílem poskytnout pomoc a podporu jedincům bojujícím s poruchami příjmu potravy. Slouží jako cenný nástroj pro pacienty, pečovatele, či kohokoliv kdo má zájem se vzdělat o tématice PPP, a byla vyvinuta ve spolupráci s psychiatrickou klinikou Všeobecné fakultní nemocnice v Praze

# projectTwoDescription
source: The Boba tea application is a ready-to-use solution that provides a seamless online shopping experience. It includes features such as navigation, item customization, cart management, order screens, and secure login/authentication using Firebase.
cs: Aplikace Boba tea je připravené řešení, které demonstruje zážitek z online nakupování. Obsahuje funkce jakoje navigace, konfiguraci vybraného zboží, správu košíku, obrazovky objednávky a bezpečné přihlášení/ověření pomocí Firebase platformy.

# projectThreeDescription
source: The Login Application is a ready-to-use login solution with a responsive user interface (UI) designed to work seamlessly on both desktop and mobile devices. It offers multiple authentication methods, including Google and Facebook accounts, providing users with a convenient and secure login experience.
cs: Aplikace pro přihlášení je připravené řešení s responzivním uživatelským rozhraním (UI), které je navrženo tak, aby bezproblémově fungovalo na stolních počítačích i mobilních zařízeních. Nabízí několik metod pro přihlášení a ověření totožnosti, včetně účtů Google a Facebook, což uživatelům poskytuje pohodlný a bezpečný zážitek při přihlášení

# projectFourDescription
source: As a designer, developer, and technology enthusiast, I've created a comprehensive collection of UIs tailored for various use cases such as login, ecommerce, chat, and more. These UI designs are the perfect fit for those seeking quick adaptability and seamless integration into their projects. Among the apps included is my personally crafted UI design for an online groceries application, characterized by its minimalistic and clean aesthetic. Explore this collection and elevate your user experience to new heights.
cs: Jako designér, vývojář a technologický nadšenec jsem sestavil kolekci uživatelských rozhraní (UI) pro různé účely, včetně přihlašování, ecommerce, chatu a dalších. Tyto designy jsou ideálním řešením pro ty, kteří si přejí rychle přizpůsobit design svým potřebám. Jedním z návrhů v této kolekci je minimalistický a čistý design UI pro online obchod s potravinami. Objevte tuto kolekci a posuňte uživatelský zážitek na novou úroveň.

# projectFiveDescription
source: This interface offers a seamless chatting experience where users can connect and interact with other members of their community. One of the key features is the ability to schedule messages, ensuring timely communication. I have selected shades of grey as the background color and for accents in the dark mode, creating a sleek and modern look. In the light mode, I have incorporated a combination of grey and white, which not only maintains a clean aesthetic but also helps manage users' attention.
cs: The Wall slouzi jako komunikační nástroj pro jakoukoliv komunitu. Jednou z klíčových funkcí je možnost plánování zpráv, které zajišťuje včasnou komunikaci. Odstíny šedé jsem vybral jako pozadí i jako akcenty v tmavém režimu, čímž vznikl elegantní a moderní vzhled. Ve světlém nastavení jsem zahrnul kombinaci šedé a bílé, která slouží nejen pro čistý vzhled, ale také pomáhá udržet pozornost uživatelů

# projectSixDescription
source: The ChatbotGPT Application is your personal virtual assistant powered by OpenAI's ChatGPT. Engage in natural and intuitive conversations with advanced language processing capabilities. From information retrieval to task automation, the chatbot provides personalized and reliable assistance. Experience the future of chatbot technology and unlock the power of intelligent interactions.
cs: Aplikace ChatbotGPT je vaším osobním virtuálním asistentem, poháněným technologií ChatGPT od OpenAI. Užívejte si přirozené a intuitivní konverzace s pokročilými možnostmi zpracování jazyka. Od získávání informací po automatizaci úkolů vám ChatbotGPT poskytuje personalizovanou a spolehlivou pomoc. Zažijte budoucnost chatbot technologií a objevte sílu inteligentních interakcí.

# projectSevenDescription
source: The EV Control Hub App is a cutting-edge mobile application designed to enhance the convenience and efficiency of electric vehicle (EV) ownership. This app serves as a comprehensive solution for EV owners, offering a range of features to streamline daily operations, promote sustainability, and ensure optimal vehicle performance. Key functionalities include remote lock, AC maintenance, charging management, and tire pressure monitoring.
cs: EV Control Hub App je UI mobilní aplikace navržená k zvýšení pohodlí a efektivity vlastnictví elektrického vozidla (EV). Tato aplikace nabízí řadu funkcí pro zjednodušení každodenních operací majitelů EV, podporu udržitelnosti a zajištění optimálního výkonu vozidla. Klíčové funkce zahrnují dálkové zamknutí, údržbu klimatizace, správu nabíjení a monitorování tlaku v pneumatikách.

# projectEightDescription
source: MexiEats is your one-stop destination for savoring the rich and flavorful world of Mexican cuisine, right at your fingertips. This food ordering app is tailor-made for a Mexican restaurant, offering a delightful blend of custom account creation, interactive UI, order creation, secure payment options, and seamless integration with an admin web application for streamlined content management, order tracking, and maintenance.
cs: MexiEats je branou do bohatého a chutného světa mexické kuchyně, přímo na dosah ruky. Tato aplikace pro objednávání jídla je šitá na míru pro mexickou restauraci a obsahuje několik full stack funkcioanlit jako je vytváření účtů, interaktivní uživatelské rozhraní, vytváření objednávek, bezpečné platební možnosti a bezproblémovou integraci s administrativní webovou aplikací pro efektivní správu obsahu, sledování objednávek a údržbu.

# projectNineDescription
source: Muzik is not just another music app; it's a personalized experience that puts the power of music in your hands. Muzik offers a vast library of songs, utilizing the Deezer API model and navigation, and a unique UI kit for further enhancements, featuring customizable layouts and colors to suit your individual style.
cs: Muzik není jen další hudební aplikací; je to personalizovaný zážitek, který nabízí rozsáhlou knihovnu písní, využívající model a navigaci Deezer API, a jedinečný UI kit pro další vylepšení, který umožňuje přizpůsobitelný layout a barvy, které ladí s vaším individuálním stylem

# projectTenDescription
source: Isn't it unbelievable that in today's era of practically unlimited possibilities, we're still inundated with marketing campaigns full of errors? ðŸ¤” How about training a language model to avoid such mistakes?
cs: Je neuvěřitelné, že i v dnešní době prakticky neomezených možností, jsme stále zavaleni kampaněmi plnými chyb, a to i hned v prvním řádku? Co takhle natrénovat jazykový model, který by se vyvaroval podobným chybám?

# languages
source: Languages I speak:
cs: Jazyky které ovládám:

# engLevel
source: Fluent
cs: plynule

# czeLevel
source: Native
cs: rodilý mluvčí

# spaLevel
source: Elementary
cs: pokročilý

# gerLevel
source: Elementary
cs: pokročilý

# certifications
source: Obtained certifications:
cs: Dosažené certifikace:

# credit
source: Design inspired by
cs: Inspirováno
